In [1]:
import pandas as pd

In [3]:
ufo = pd.read_csv("data/ufo.csv")

In [4]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [5]:
ufo.shape

(18241, 5)

In [6]:
# axis boyutları belirtir. bu dataframe 2 boyutludur. 1 boyut rowları 2. boyut columnları gösterir.
ufo.drop("Colors Reported",axis=1, inplace=True)

In [7]:
ufo.head()

                   City Shape Reported State             Time
0                Ithaca       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro          OTHER    NJ  6/30/1930 20:00
2               Holyoke           OVAL    CO  2/15/1931 14:00
3               Abilene           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair          LIGHT    NY  4/18/1933 19:00

In [8]:
ufo.drop(["City","State"],axis=1, inplace=True)

In [9]:
ufo.head()

  Shape Reported             Time
0       TRIANGLE   6/1/1930 22:00
1          OTHER  6/30/1930 20:00
2           OVAL  2/15/1931 14:00
3           DISK   6/1/1931 13:00
4          LIGHT  4/18/1933 19:00

In [13]:
ufo.drop(range(0,10),axis=0, inplace=True)

In [14]:
ufo.shape

(18231, 2)

In [15]:
ufo.head()

   Shape Reported             Time
10          LIGHT  8/15/1937 21:00
11       FIREBALL   6/1/1939 20:00
12         SPHERE  6/30/1939 20:00
13           OVAL    7/7/1939 2:00
14           DISK   6/1/1941 13:00